PH_data/alpha_0.65/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
12992
(
( 3.371533967e-05 -9.436537766e-06 3.451534383e-07 2.366012995e-05 -1.450973599e-07 3.671261584e-05 )
( 3.366864621e-05 -9.303402294e-06 5.148722835e-07 2.357682024e-05 -2.93197445e-07 3.671562808e-05 )
( 3.230020593e-05 -7.518478014e-06 7.395295398e-08 2.008520278e-05 9.13630771e-09 3.72564391e-05 )
( 3.351911801e-05 -9.095474525e-06 6.461218618e-07 2.340997889e-05 -3.340970522e-07 3.691692473e-05 )
( 3.238106729e-05 -7.464932423e-06 2.270492985e-07 2.001888424e-05 -1.143197395e-07 3.742340778e-05 )
( 3.15962352e-05 -6.384548215e-06 -4.955671429e-08 1.771185816e-05 6.123868701e-08 3.773847129e-05 )
( 3.147145253e-05 -6.351448519e-06 -8.178149358e-08 1.771640382e-05 8.269293517e-08 3.77003671e-05 )
( 3.233156895e-05 -7.349226507e-06 4.185066302e-07 1.985783638e-05 -1.975595865e-07 3.779554754e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
